result/result_probably_consolidated/xl170(broadwell)_consolidated_4core_8iothread_1/multiplier_1/run9.txt
# run=9/10
# 2026-04-06T00:38:26-06:00
# cmd: taskset -c 1-19 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            845362
        write:                           219917
        other:                           112898
        total:                           1178177
    transactions:                        52515  (874.70 per sec.)
    queries:                             1178177 (19623.87 per sec.)
    ignored errors:                      7868   (131.05 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      874.6965
    time elapsed:                        60.0380s
    total number of events:              52515

Latency (ms):
         min:                                    2.45
         avg:                                   36.57
         max:                                  217.09
         95th percentile:                       75.82
         sum:                              1920444.58

Threads fairness:
    events (avg/stddev):           1641.0938/24.50
    execution time (avg/stddev):   60.0139/0.01